{
    "id": 22,
    "title": "Naja Mosque",
    "year": 2020,
    "categories": ["Design Development", "Tessellation Systems"],
    "description": "Mathematical tiling as a luminous ceiling, guiding worshippers into a state of serenity",
    "timestamp": "December '20",
    "previewImage": "https://res.cloudinary.com/dnahwqvhd/image/upload/w_800,f_auto,q_auto/v1762089545/d5484b149433283.62e7c72986858_oc2csf.jpg",
    "content": {
        "paragraphs": [
            "",
            "This mosque project reimagines the traditional skyline presence of minarets through a contemporary computational approach. Four new peaks emerge as defining vertical elements, generated by the form-finding process of a hanging relaxed mesh. These minarets punctuate the horizon with a fluid yet iconic silhouette, symbolizing both spiritual ascent and architectural innovation. The project seeks to merge structural logic with symbolic expression, creating a landmark that resonates with both the city’s skyline and the spiritual aspirations of its community.",
            "The primary generative method relies on the physics of a suspended mesh, digitally simulated to achieve natural equilibrium. By inverting the relaxed mesh geometry, the design produces soaring peaks that define the four minarets, while simultaneously shaping the mosque’s roofscape. This computational process ensures that the form is not arbitrary but derived from material behavior and structural efficiency, resulting in an architecture that feels both organic and monumental. The mesh logic allows the mosque to embody a sense of lightness and continuity, while still maintaining the gravitas of sacred architecture.",
            "Inside, the roof ceiling pattern draws inspiration from mathematical tiling systems, where geometric precision is harnessed to choreograph light. The tessellated ceiling filters daylight into the prayer hall, producing shifting patterns of illumination that enhance the serenity of the interior. This interplay of light and geometry creates a contemplative atmosphere, reinforcing the spiritual experience of worshippers. By combining the structural elegance of the mesh-derived form with the poetic effects of patterned light, the mosque becomes both a place of devotion and a living expression of harmony between mathematics, nature, and faith."
        ],
        "media": [
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/w_1200,f_auto,q_auto/v1762089545/d5484b149433283.62e7c72986858_oc2csf.jpg",
                "caption": "Street-level view of the mosque",
                "position": "after-paragraph-0"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/w_1200,f_auto,q_auto/v1762089545/form-finding_il9kkr.png",
                "caption": "Form-finding diagram",
                "position": "after-paragraph-0"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/w_1200,f_auto,q_auto/v1762089545/de9328149433283.62e7c728e5837_gthiug.png",
                "caption": "3D model of the roof tessellation study",
                "position": "after-paragraph-1"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/w_1200,f_auto,q_auto/v1762089545/7864a1149433283.62e7c729873d4_q5e5mi.jpg",
                "caption": "Partial side elevation",
                "position": "after-paragraph-2"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/w_1200,f_auto,q_auto/v1762089545/roof_04_v7duqp.png",
                "caption": "Detail line roof tiling system",
                "position": "after-paragraph-3"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/w_1200,f_auto,q_auto/v1762090090/a67bec149433283.62e7c728e46fe_gdddtu.jpg",
                "caption": "Exploded diagram illustrating the various elements of the mosque",
                "position": "after-paragraph-3"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1763933246/c0a0ae149433283.62e7c7298866e_xwtnpp.jpg",
                "caption": "Interior view highlighting the dramatic effect of the roof slits",
                "position": "end"
            }
        ]
    }
}