{
    "id": 17,
    "title": "Science City",
    "year": 2017,
    "description": "Peeling Histories, Leaping Futures: Generative Design Systems for Multi‑Layered Surfaces @Unii",
    "timestamp": "September '17",
    "previewImage": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1762051017/06-NIGHT_shot_qamppc.jpg",
    "content": {
        "paragraphs": [
            "",
            "The Science City project is conceived as a symbolic architectural journey through time, standing on the solid platform of multi‑layers of history while leaping toward the future in the “cloud of science.” It reflects the present condition—what is described as the “shadow of science”—and seeks to bridge the gap between past, present, and future. The project embodies the will of change, peeling back layers of history to reveal new possibilities, and creating a visionary urban landmark that merges cultural memory with futuristic aspirations.",
            "The design process was driven by the simulation of peeling forces, which became both a metaphor and a structural strategy. By experimenting with the act of peeling, the project explored how thin surfaces could be shaped, curved, and tensioned to achieve structural stability. This method of form finding allowed the architecture to embody the dynamic reaction of leaping forward, while simultaneously simulating the performance of delicate yet resilient surfaces. The curvature generated by these peeling forces produced a family of forms that balance lightness, strength, and expressive geometry.",
            "The architectural expression culminates in a double‑skin layering system that echoes the multi‑layers of history while projecting a futuristic identity. The outer skin acts as a protective and symbolic veil, while the inner layer defines the functional spaces. Between them, light filters dramatically, creating shifting patterns of shadow and illumination that reinforce the narrative of moving from the “shadow of science” toward the “cloud of science.” This interplay of layers and light transforms the project into a living timeline—an immersive spatial experience that celebrates both heritage and innovation."
        ],
        "media": [
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1762051017/06-NIGHT_shot_qamppc.jpg",
                "caption": "Optional caption",
                "position": "after-paragraph-0"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1762051017/15-Form_Generation_cj1m6d.jpg",
                "caption": "Optional caption",
                "position": "after-paragraph-0"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1762051017/20-Elements_slmzq7.jpg",
                "caption": "Optional caption",
                "position": "after-paragraph-1"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1762051017/16-Sequentional_Sections_woxdhy.jpg",
                "caption": "Optional caption",
                "position": "after-paragraph-2"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1762051017/18-Environmental_lyc3qe.png",
                "caption": "Optional caption",
                "position": "after-paragraph-3"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1762051017/17-Pattern_2_oi5lar.jpg",
                "caption": "Optional caption",
                "position": "after-paragraph-3"
            },
            
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1762051572/image_54_r1l2ho.png",
                "caption": "Optional caption",
                "position": "end"
            }
        ]
    }
}

