{
    "id": 3,
    "title": "Acropora",
    "year": 2020,
    "description": "Defferential growth and particles system simulation @IAAC",
    "timestamp": "Nov '20",
    "previewImage": "https://res.cloudinary.com/dnahwqvhd/video/upload/v1761938536/growth_wtk9xz.mp4",
    "content": {
        "paragraphs": [
            "",
            "Due to the evolution of computation in the field of design and environmental awareness. This project is to define a new urban structure that is inspired by nature and evolves based on external conditions; moreover, it seeks to take corals as inspiration to define new computational design methods to explore form interpretations based on the differential growth processes that occur in natural ecosystems.  This project was based on principles found in corals to provide a better design outcome.",
            "Acropora is known as table coral with more than 140 species. Acropora species are some of the major reef corals responsible for building the immense calcium carbonate substructure that supports the thin living skin of a reef. The corals evolved as an important part of the whole ocean ecosystem. Their intricate geometries provide shelter for one-quarter of ocean life. Corals grow towards the sun, and its growth can be shaped by the water currents and location within the colony. The ridges of coral reefs can reduce wave energy by 95% protecting from tsunamis. Unfortunately, roughly one-quarter of coral reefs worldwide are already considered damaged beyond repair, with another two-thirds under serious threat. The corals’ biggest threats are climate change, destructive fishing practices, overfishing, careless tourism, and pollution. Differential growth in nature happens when one part of a cell’s growth occurs at a different rate from that other part. Compared with a uniform growth of the sphere, a shape with differential growth can offer more structural rigidity to withstand local loads. Moreover, it allows for better surface area to volume ratio, which is constrained for spheres. Growth in a specific direction in nature can respond to the environment including light, touch or contact with a solid object, water concentrations or heat or temperature changes.",
            "As part of the design explorations using differential growth, this project establishes a new computation design process based on the following parameters: Radius - Edge Length - Noise - Vectors - Attractor - Distance between faces",
            "Acropora is a project of IAAC, Institute of Advanced Architecture of Catalonia developed at Master In Advanced Computation For Architecture & Design in 2020 by students: Aleksandra Jastrzebska, Felipe Romero, Hesham Shawqy Lead Faculty:  Arthur Mamou-Mani Faculty Assistant: Krishna Bhat"
        ],
        "media": [
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1761937607/image152_gftwir.jpg",
                "caption": "Optional caption",
                "position": "after-paragraph-0"
            },
            {
                "type": "video",
                "src": "https://res.cloudinary.com/dnahwqvhd/video/upload/v1761938536/growth_wtk9xz.mp4",
                "caption": "Optional caption",
                "position": "after-paragraph-1"
            },
            {
                "type": "gif",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1761937617/it02a-1_umdzb1.gif",
                "caption": "Optional caption",
                "position": "after-paragraph-2"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1761937622/04-2_sthywb.png",
                "caption": "Optional caption",
                "position": "after-paragraph-2"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1761937593/image138_matg84.jpg",
                "caption": "Optional caption",
                "position": "after-paragraph-3"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1761937595/10-3_oc8n3d.png",
                "caption": "Optional caption",
                "position": "after-paragraph-3"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1761937599/image143_ahsame.jpg",
                "caption": "Optional caption",
                "position": "after-paragraph-3"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1761939011/image151_cpegsl.jpg",
                "caption": "Optional caption",
                "position": "after-paragraph-3"
            },
            {
                "type": "image",
                "src": "https://res.cloudinary.com/dnahwqvhd/image/upload/v1761937606/image153_l0vwu2.jpg",
                "caption": "Optional caption",
                "position": "after-paragraph-3"
            }
        ]
    }
}

